CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Tx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RTC">
      <name>SEC_RTC</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x50002800</baseAddress>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG0</name>
          <displayName>CFG0</displayName>
          <description>Configuration register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_MODE</name>
              <description>Boot mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
             <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS0</name>
          <displayName>EXTISS0</displayName>
          <description>EXTI sources selection register
          0</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI3_SS</name>
              <description>EXTI 3 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI2_SS</name>
              <description>EXTI 2 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI1_SS</name>
              <description>EXTI 1 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI0_SS</name>
              <description>EXTI 0 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS1</name>
          <displayName>EXTISS1</displayName>
          <description>EXTI sources selection register
          1</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI7_SS</name>
              <description>EXTI 7 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI6_SS</name>
              <description>EXTI 6 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI5_SS</name>
              <description>EXTI 5 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI4_SS</name>
              <description>EXTI 4 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS2</name>
          <displayName>EXTISS2</displayName>
          <description>EXTI sources selection register
          2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI11_SS</name>
              <description>EXTI 11 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI10_SS</name>
              <description>EXTI 10 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI9_SS</name>
              <description>EXTI 9 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI8_SS</name>
              <description>EXTI 8 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISS3</name>
          <displayName>EXTISS3</displayName>
          <description>EXTI sources selection register
          3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI15_SS</name>
              <description>EXTI 15 sources selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI14_SS</name>
              <description>EXTI 14 sources selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI13_SS</name>
              <description>EXTI 13 sources selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EXTI12_SS</name>
              <description>EXTI 12 sources selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPSCTL</name>
          <displayName>CPSCTL</displayName>
          <description>I/O compensation control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPS_RDY</name>
              <description>I/O compensation cell is ready or not</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPS_EN</name>
              <description>I/O compensation cell enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECFG</name>
          <displayName>SECFG</displayName>
          <description>SYSCFG secure configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FPUSE</name>
              <description>FPU security</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1SE</name>
              <description>SRAM1 security</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLASSBSE</name>
              <description>ClassB security</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCFGSE</name>
              <description>SYSCFG clock control security</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>FPUINTMSK</name>
          <displayName>FPUINTMSK</displayName>
          <description>FPU interrupt mask register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>FPU_IE</name>
              <description>Floating point unit interrupts enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CNSLOCK</name>
          <displayName>CNSLOCK</displayName>
          <description>SYSCFG CPU non-secure lock register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCKNSMPU</name>
              <description>Non-secure MPU registers lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKNSVTOR</name>
              <description>VTOR_NS register lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CSLOCK</name>
          <displayName>CSLOCK</displayName>
          <description>SYSCFG CPU secure lock register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAULK</name>
              <description>SAU registers lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPULK</name>
              <description>Secure MPU registers lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VTSAIRLK</name>
              <description>VTOR_S register and AIRCR register bits lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CFG1</name>
          <displayName>CFG1</displayName>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LVD_LOCK</name>
              <description>LVD lock enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex M33 LOCKUP (hardfault) output enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>SCS</name>
          <displayName>SCS</displayName>
          <description>SYSCFG SRAM1 control and status register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRAM1BSY</name>
              <description>SRAM1 busy by erase operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAM1ERS</name>
              <description>SRAM1 erase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>SKEY</name>
          <displayName>SKEY</displayName>
          <description>SYSCFG SRAM1 key register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>SRAM1 write protection key for software erase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>SWP0</name>
          <displayName>SWP0</displayName>
          <description>SYSCFG SRAM1 write protection register 0</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>P31WP</name>
              <description>SRAM1 1 Kbyte page 31 write protection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30WP</name>
              <description>SRAM1 1 Kbyte page 30 write protection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29WP</name>
              <description>SRAM1 1 Kbyte page 29 write protection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28WP</name>
              <description>SRAM1 1 Kbyte page 28 write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27WP</name>
              <description>SRAM1 1 Kbyte page 27 write protection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26WP</name>
              <description>SRAM1 1 Kbyte page 26 write protection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25WP</name>
              <description>SRAM1 1 Kbyte page 25 write protection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24WP</name>
              <description>SRAM1 1 Kbyte page 24 write protection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23WP</name>
              <description>SRAM1 1 Kbyte page 23 write protection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22WP</name>
              <description>SRAM1 1 Kbyte page 22 write protection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21WP</name>
              <description>SRAM1 1 Kbyte page 21 write protection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20WP</name>
              <description>SRAM1 1 Kbyte page 20 write protection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19WP</name>
              <description>SRAM1 1 Kbyte page 19 write protection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18WP</name>
              <description>SRAM1 1 Kbyte page 18 write protection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17WP</name>
              <description>SRAM1 1 Kbyte page 17 write protection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16WP</name>
              <description>SRAM1 1 Kbyte page 16 write protection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15WP</name>
              <description>SRAM1 1 Kbyte page 15 write protection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14WP</name>
              <description>SRAM1 1 Kbyte page 14 write protection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13WP</name>
              <description>SRAM1 1 Kbyte page 13 write protection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12WP</name>
              <description>SRAM1 1 Kbyte page 12 write protection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11WP</name>
              <description>SRAM1 1 Kbyte page 11 write protection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10WP</name>
              <description>SRAM1 1 Kbyte page 10 write protection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9WP</name>
              <description>SRAM1 1 Kbyte page 9 write protection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8WP</name>
              <description>SRAM1 1 Kbyte page 8 write protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7WP</name>
              <description>SRAM1 1 Kbyte page 7 write protection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6WP</name>
              <description>SRAM1 1 Kbyte page 6 write protection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5WP</name>
              <description>SRAM1 1 Kbyte page 5 write protection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4WP</name>
              <description>SRAM1 1 Kbyte page 4 write protection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3WP</name>
              <description>SRAM1 1 Kbyte page 3 write protection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2WP</name>
              <description>SRAM1 1 Kbyte page 2 write protection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>            <field>
              <name>P1WP</name>
              <description>SRAM1 1 Kbyte page 1 write protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0WP</name>
              <description>SRAM1 1 Kbyte page 0 write protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

