CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Tx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER5">
      <name>SEC_TIMER5</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
<peripheral>
      <name>CAU</name>
      <description>Cryptographic acceleration unit</description>
      <groupName>CAU</groupName>
      <baseAddress>0x4C060000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
     <interrupt>
        <name>CAU</name>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>CAU control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>          
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALGM_3</name>
              <description>Encryption/decryption algorithm mode bit 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>GCM_CCMPH</name>
              <description>GCM CCM phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>CAUEN</name>
              <description>Cryptographic module enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
             <access>read-write</access>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>FIFO flush</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <access>write-only</access>
            </field>
            <field>
              <name>KEYM</name>
              <description>AES key size mode configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAM</name>
              <description>Data swapping type mode configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALGM</name>
              <description>Encryption/decryption algorithm mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
           <field>
              <name>CAUDIR</name>
              <description>CAU direction</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>STAT0</name>
          <displayName>STAT0</displayName>
          <description>CAU status register 0</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFU</name>
              <description>OUT FIFO full flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONE</name>
              <description>OUT FIFO not empty flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INF</name>
              <description>IN FIFO not full flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>IEM</name>
              <description>IN FIFO empty flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>DI</name>
          <displayName>DI</displayName>
          <description>CAU data input register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DI</name>
              <description>Data input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>DO</name>
          <displayName>DO</displayName>
          <description>CAU data output register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DO</name>
              <description>Data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>DMAEN</name>
          <displayName>DMAEN</displayName>
          <description>CAU DMA enable  register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAOEN</name>
              <description>Out FIFO DMA enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>In FIFO DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>CAU interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OINTEN</name>
              <description>Out FIFO interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IINTEN</name>
              <description>In FIFO interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>STAT1</name>
          <displayName>STAT1</displayName>
          <description>CAU interrupt status flag register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OSTA</name>
              <description>Out FIFO interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISTA</name>
              <description>In FIFO interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <displayName>INTF</displayName>
          <description>CAU enable interrupt status flag register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OINTF</name>
              <description>Out FIFO enabled interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IINTF</name>
              <description>In FIFO enabled interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>KEY0H</name>
          <displayName>KEY0H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY0H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>KEY0L</name>
          <displayName>KEY0L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY0L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>KEY1H</name>
          <displayName>KEY1H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>KEY1L</name>
          <displayName>KEY1L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY1L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>KEY2H</name>
          <displayName>KEY2H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>KEY2L</name>
          <displayName>KEY2L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY2L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>KEY3H</name>
          <displayName>KEY3H</displayName>
          <description>CAU key register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY3H</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>KEY3L</name>
          <displayName>KEY3L</displayName>
          <description>CAU key register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY3L</name>
              <description>Key for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>IV0H</name>
          <displayName>IV0H</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV0H</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>IV0L</name>
          <displayName>IV0L</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV0L</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>IV1H</name>
          <displayName>IV1H</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV1H</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IV1L</name>
          <displayName>IV1L</displayName>
          <description>CAU initialization register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IV1L</name>
              <description>The initialization vector for DES,TDES,AES</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
