CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Tx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SEC_SPI1</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
<peripheral derivedFrom="SPI1">
      <name>I2S1_add</name>
      <baseAddress>0x40003400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SEC_I2S1_add</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x50003400</baseAddress>
    </peripheral>
<peripheral>
      <name>SQPI</name>
      <description>Serial/Quad Parallel Interface</description>
      <groupName>SQPI</groupName>
      <baseAddress>0x40025400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INIT</name>
          <displayName>INIT</displayName>
          <description>SQPI Initial Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x18010004</resetValue>
          <fields>
            <field>
              <name>PL</name>
              <description>Read data sample polarity.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDLEN</name>
              <description>SQPI controller external memory ID length
              </description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADDRBIT</name>
              <description>Bit number of SPI PSRAM address phase.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divider for SQPI output clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CMDBIT</name>
              <description>Bit number of SQPI controller command phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCMD</name>
          <displayName>RCMD</displayName>
          <description>SQPI Read Command Register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <fields>
            <field>
              <name>RID</name>
              <description>Send read ID command</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMODE</name>
              <description>SQPI controller read command mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RWAITCYCLE</name>
              <description>SQPI read command waitcycle number after address phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RCMD</name>
              <description>SQPI read command for AHB read transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WCMD</name>
          <displayName>WCMD</displayName>
          <description>Write Command Register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue> 0x00010000</resetValue>
          <fields>
             <field>
              <name>SCMD</name>
              <description>Send special command </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WMODE</name>
              <description>SQPI controller write command mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WWAITCYCLE</name>
              <description>SQPI write command waitcycle number after address phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WCMD</name>
              <description>SQPI write command for AHB write transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDL</name>
          <displayName>IDL</displayName>
          <description>ID Low Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDL</name>
              <description>ID Low Data saved for SQPI Read ID Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDH</name>
          <displayName>IDH</displayName>
          <description>ID High Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDH</name>
              <description>ID High Data saved for SQPI read ID command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
