CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Tx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="FS_DEVICE">
      <name>SEC_FS_DEVICE</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x59000800</baseAddress>
    </peripheral>

<peripheral>
      <name>FS_PWRCLK</name>
      <description>USB on the go full speed</description>
      <groupName>USB_FS</groupName>
      <baseAddress>0x49000E00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWRCLKCTL</name>
          <displayName>PWRCLKCTL</displayName>
          <description>power and clock gating control
          register (PWRCLKCTL)</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUCLK</name>
              <description>Stop the USB clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHCLK</name>
              <description>Stop HCLK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="FS_PWRCLK">
      <name>SEC_FS_PWRCLK</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x59000E00</baseAddress>
    </peripheral>
  </peripherals>
</device>
